app/Helpers/helpers.php

select count(*) as aggregate from `favorite_products` where `user_id` = 5
---
function totalProduct()
{
    if(Auth::user()->hasRole('Admin')){
        $data = \App\Models\ProductResearch::count();
    }else{
        $data = \App\Models\FavoriteProduct::where('user_id',Auth::user()->id)->count();

select count(*) as aggregate from `enrollments` where `user_id` = 5
---
function totalCourse()
{
    if(Auth::user()->hasRole('Admin')){
        $data = \App\Models\Course::count();
    }else{
        $data = \App\Models\Enrollment::where('user_id',Auth::user()->id)->count();

select count(*) as aggregate from `projects` where `user_id` = 5
---
function totalProjects(){
    $data = \App\Models\Project::where('user_id',Auth::user()->id)->count();

select count(*) as aggregate from `interests`
---
function totalTools()
{
    $data = \App\Models\Interest::count();