app/Http/Controllers/AdInterestController.php

select * from `interests` where (`keyword` = 'fitness') limit 1
update `interests` set `hit` = 4, `interests`.`updated_at` = '2023-05-24 13:20:14' where (`id` = 4)
insert into `interests` (`keyword`, `updated_at`, `created_at`) values ('ielts', '2023-05-24 01:57:59', '2023-05-24 01:57:59')
---
    public function adInterest(Request $request){

        $q = null;
        $size = 0;
        $access_token = env('FACEBOOK_ACCESS_TOKEN');

        $results = [];

            if(isset($_GET['q'])){

                if($request->q == null)
                return redirect()->back()->with('error', 'Please enter a keyword');

                $data = Interest::where([
                    'keyword' => $request->q
                ])->first();

                if ($data) {
                    Interest::where([
                        'id' => $data->id,
                    ])
                    ->update([
                        'hit' => $data->hit + 1
                    ]);
                } else {
                    Interest::create([
                        'keyword' => $request->q
                    ]);

select * from `interests` order by `hit` desc limit 9
select * from `projects` where `user_id` = 5 order by `id` desc
---
            }

            $populars = [];
            $populars = Interest::orderBy('hit', 'desc')->take(9)->get();

            $size = count($results);

            $projects = Project::where('user_id',Auth()->user()->id)->orderBy('id', 'desc')->get();