app/Http/Controllers/AdspyController.php

select * from `projects` where `user_id` = 5 order by `id` desc
---
    public function index()
    {
        $projects = Project::where('user_id',Auth::user()->id)->orderBy('id', 'desc')->get();

select * from `projects` where `user_id` = 5 order by `id` desc
---
    public function facebook()
    {
        $queries = Query::where('user_id',Auth::user()->id)->orderBy('id', 'desc')->take(5)->get();
        $projects = Project::where('user_id',Auth::user()->id)->orderBy('id', 'desc')->get();

select * from `projects` where `user_id` = 8 order by `name` asc
---
    public function mylist()
    {
        $projects = Project::where('user_id',Auth::user()->id)->orderBy('name', 'asc')->get();

select * from `projects` where `user_id` = 5 order by `name` asc
---
    public function details($id)
    {
        $projects = Project::where('user_id',Auth::user()->id)->orderBy('name', 'asc')->get();

select * from `projects` where `user_id` = 5 order by `id` desc
---
    public function saveAdInProject(Request $request){
        $allInputs = $request->all();
        $project_name = $allInputs['project_name'];
        $project_id = $allInputs['project_id'];
        $adData = $allInputs['adData'];

        if($project_name){
            $project = Project::where(['name' => $project_name, 'user_id' => Auth::user()->id])->first();
            $project_id = isset($project) ? $project->id : '';
        }

        if(!$project_id){
            $project = new Project();
            $project->name = $project_name;
            $project->user_id = Auth::user()->id;
            $project->save();
            $project_id = $project->id;
        }

        $result = $this->saveAdToProject($project_id, $adData);
        $projects = Project::where('user_id', Auth::user()->id)->orderBy('id', 'desc')->get();

select * from `projects` where `user_id` = 5 order by `name` asc
---
    public function saveAdInProjectNew(Request $request){
        $allInputs = $request->all();
        $project_name = $allInputs['project_name'];
        $project_id = $allInputs['project_id'];
        $ad_id = $allInputs['ad_id'];

        if($project_name){
            $project = Project::where(['name' => $project_name, 'user_id' => Auth::user()->id])->first();
            $project_id = isset($project) ? $project->id : '';
        }

        if(!$project_id){
            $project = new Project();
            $project->name = $project_name;
            $project->user_id = Auth::user()->id;
            $project->save();
            $project_id = $project->id;
        }
        $result = $this->saveAdToProjectNew($project_id, $ad_id);
        $projects = Project::where('user_id',Auth::user()->id)->orderBy('name', 'asc')->get();