app/Http/Controllers/HomeController.php

    public function index()
    {
        $userCount = User::count();
        $productsCount = ProductResearch::count();
        $courseCount = Course::count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `product_research`
select count(*) as aggregate from `courses`