app/Http/Controllers/KpiCalculatorController.php

select * from `projects` where `user_id` = 8 order by `id` desc
---
    public function calculator()
    {
        $data = '';
        $projects = Project::where('user_id',Auth()->user()->id)->orderBy('id', 'desc')->get();

select * from `projects` where `user_id` = 8 order by `id` desc
select * from `kpi_calculators` where (`id` = '10' and `project_id` = '11' and `user_id` = 8) limit 1
---
    public function singleKpiData($pid, $kpiId){
        $projects = Project::where('user_id',Auth()->user()->id)->orderBy('id', 'desc')->get();
        $kpi = KpiCalculator::where(['id' => $kpiId,'project_id' => $pid, 'user_id' => Auth::user()->id])->first();

insert into `kpi_calculators` (`user_id`, `project_id`, `data`, `updated_at`, `created_at`) values (8, '11', '{\"B2\":\"Iusto sit in et moll\",\"B3\":\"Ea unde voluptate ra\",\"B4\":\"Ea non ut pariatur\",\"B5\":\"Nulla nulla minus ci\",\"B8\":\"Magnam earum quo ea\",\"B9\":\"Iure vel et molestia\",\"B10\":\"Velit error et lorem\",\"G2\":\"NaN\",\"G3\":\"NaN\",\"G4\":\"NaN\",\"G5\":\"NaN\",\"G6\":\"NaN\",\"K2\":\"NaN\",\"K3\":\"NaN\",\"K4\":\"NaN\",\"K5\":\"NaN\",\"K6\":\"NaN\"}', '2023-05-24 14:55:41', '2023-05-24 14:55:41')
---
    public function saveCalculateData(Request $request){

        $validated = $request->validate([
            'previous_project' => 'required_without_all:name',
            'name' => 'required_without_all:previous_project',
            'data' => 'required',
        ],[
            'project_details.required' => 'Selection interest cant be empty',
            'previous_project.required' => 'Please select or insert a new project name',
        ]);
        $data = $request->data;
        $project_id = $request->previous_project;

        if(!$project_id){
            $project = Project::create([
                'user_id' => Auth()->user()->id,
                'name' => $request->name,
            ]);
            $project_id = $project->id;
        }
        $kpiCalculator = KpiCalculator::create([
            'user_id' => Auth()->user()->id,
            'project_id' => $project_id,
            'data' => json_encode($data),
        ]);