app/Http/Controllers/ProjectController.php

select * from `projects` where `user_id` = 8 order by `id` desc
---
    public function index()
    {
        $projects = Project::with('kpis')->where('user_id',Auth::user()->id)->orderBy('id', 'desc')->get();

select * from `projects` where (`id` = '2') limit 1
select * from `interests` order by `hit` desc limit 9
---
    public function projectsingle($id)
    {
        $results = [];

        $all_results = Project::where(['id' => $id])->first();

        $results = $all_results['details'];

        $results = json_decode($results, true);

        $audience_size_modified = [];

        if (is_array($results))
        {

            foreach ($results as $data) {

                $data = json_decode($data);
                $data->addprojectlistaudience_size_lower_bound = $this->makeAudienceToKilloandMillion($data->audience_size_lower_bound);
                $data->audience_size_upper_bound = $this->makeAudienceToKilloandMillion($data->audience_size_upper_bound);
                $audience_size_modified[] = $data;
            }
        }

        $results = $audience_size_modified;

        $populars = [];

        $populars = Interest::orderBy('hit', 'desc')->take(9)->get();