app/Http/Controllers/Admin/AdminProductController.php

select * from `categories` order by `id` desc
---
    public function create()
    {
        $categories = Category::orderby('id', 'desc')->get();